# Install command-line tools using Homebrew
#
#   brew bundle --file=~/.dotfiles/Brewfile
#
# Enable patched font for iTerm: iTerm2 → Preferences → Profiles → Font

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'ansible'
brew 'bat'
brew 'cowsay'
brew 'docker-compose'
brew 'dua-cli'
brew 'exa'
brew 'eza'
brew 'fd'
brew 'font-jetbrains-mono-nerd-font'
brew 'fzf'
brew 'git'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'ncdu'
brew 'neovim'
brew 'node'
brew 'postgresql'
brew 'pure'
brew 'ripgrep'
brew 'rsync'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh'

# brew 'spaceship'
# brew 'docker-machine'
# brew 'figlet'
# brew 'pow'
# brew 'pyenv'
# brew 'rbenv'
# brew 'rclone'
# brew 'lame'
# brew 'micro'
# brew 'nnn'

# Desktop apps
cask '1password'
cask 'bartender'
cask 'betterdisplay'
cask 'cleanmymac'
cask 'cleanshot'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'qlmarkdown'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'sublime-merge'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'xbar'
cask 'zoomus'

# cask 'ableton-live-suite'
# cask 'ilya-birman-typography-layout'
# cask 'qlcolorcode'
# cask 'quicklook-json'

# Fonts
cask 'font-jetbrains-mono'
brew 'font-jetbrains-mono-nerd-font'
# cask 'font-anonymous-pro'
# cask 'font-droid-sans'
# cask 'font-droid-sans-mono'
# cask 'font-inconsolata'
# cask 'font-pt-mono'
# cask 'font-pt-sans'
# cask 'font-pt-serif'
# cask 'font-roboto'
# cask 'font-roboto-mono'
