# Install command-line tools using Homebrew
#
#   brew bundle --file=~/.dotfiles/Brewfile

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'ansible'
brew 'bat'
brew 'boot2docker'
brew 'cowsay'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'exa'
brew 'fd'
brew 'figlet'
brew 'fzf'
brew 'git'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'lame'
brew 'micro'
brew 'neovim'
brew 'nnn'
brew 'node'
brew 'postgresql'
brew 'pow'
brew 'pyenv'
brew 'rbenv'
brew 'rclone'
brew 'ripgrep'
brew 'rsync'
brew 'ruby-build'
brew 'ruby-install'
brew 'tig'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh'

# Desktop apps
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'marta'
cask 'midi-monitor'
cask 'ngrok'
cask 'qlcolorcode'
cask 'quicklook-json'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'

# Fonts
cask 'font-anonymous-pro'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-inconsolata'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-roboto'
cask 'font-roboto-mono'
